# Seyed Mohammad Amin Atyabi - 830402014

## 1

### Pre Process

In [179]:
import pandas

employee_data = pandas.read_csv('data/HR-Employee-Attrition.csv')

employee_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,JobLevel,MaritalStatus,MonthlyRate,NumCompaniesWorked,OverTime,PerformanceRating,WorkLifeBalance,YearsAtCompany
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,2,Female,2,Single,19479.0,8,Yes,3,1,6
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,3,Male,2,Married,24907.0,1,No,4,3,10
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,4,Male,1,Single,2396.0,6,Yes,3,3,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,4,Female,1,Married,23159.0,1,Yes,3,3,8
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,Male,1,Married,16632.0,9,No,3,3,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,3,Male,2,Married,12290.0,4,No,3,3,5
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,4,Male,3,Married,21457.0,4,No,3,3,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,2,Male,2,Married,5174.0,1,Yes,4,3,6
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,4,Male,2,Married,13243.0,2,No,3,2,9
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,2,Male,2,Married,10228.0,2,No,3,4,4

In [180]:
employee_data.info

<bound method DataFrame.info of       Age Attrition     BusinessTravel  DailyRate              Department
0      41       Yes      Travel_Rarely       1102                   Sales  \
1      49        No  Travel_Frequently        279  Research & Development
2      37       Yes      Travel_Rarely       1373  Research & Development
3      33        No  Travel_Frequently       1392  Research & Development
4      27        No      Travel_Rarely        591  Research & Development
...   ...       ...                ...        ...                     ...
1465   36        No  Travel_Frequently        884  Research & Development
1466   39        No      Travel_Rarely        613  Research & Development
1467   27        No      Travel_Rarely        155  Research & Development
1468   49        No  Travel_Frequently       1023                   Sales
1469   34        No      Travel_Rarely        628  Research & Development

      DistanceFromHome  Education EducationField  EnvironmentSatisfaction
0                    1          2  Life Sciences                        2  \
1                    8          1  Life Sciences                        3
2                    2          2          Other                        4
3                    3          4  Life Sciences                        4
4                    2          1        Medical                        1
...                ...        ...            ...                      ...
1465                23          2        Medical                        3
1466                 6          1        Medical                        4
1467                 4          3  Life Sciences                        2
1468                 2          3        Medical                        4
1469                 8          3        Medical                        2

      Gender  JobLevel MaritalStatus  MonthlyRate  NumCompaniesWorked
0     Female         2        Single      19479.0                   8  \
1       Male         2       Married      24907.0                   1
2       Male         1        Single       2396.0                   6
3     Female         1       Married      23159.0                   1
4       Male         1       Married      16632.0                   9
...      ...       ...           ...          ...                 ...
1465    Male         2       Married      12290.0                   4
1466    Male         3       Married      21457.0                   4
1467    Male         2       Married       5174.0                   1
1468    Male         2       Married      13243.0                   2
1469    Male         2       Married      10228.0                   2

     OverTime  PerformanceRating  WorkLifeBalance  YearsAtCompany
0         Yes                  3                1               6
1          No                  4                3              10
2         Yes                  3                3               0
3         Yes                  3                3               8
4          No                  3                3               2
...       ...                ...              ...             ...
1465       No                  3                3               5
1466       No                  3                3               7
1467      Yes                  4                3               6
1468       No                  3                2               9
1469       No                  3                4               4

[1470 rows x 18 columns]>

In [181]:
employee_data.describe()

,Age,DailyRate,DistanceFromHome,Education,EnvironmentSatisfaction,JobLevel,MonthlyRate,NumCompaniesWorked,PerformanceRating,WorkLifeBalance,YearsAtCompany
count,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1436.000000,1470.000000,1470.000000,1470.000000,1470.000000
mean,36.923810,802.485714,9.192517,2.912925,2.721769,2.063946,14301.253482,2.693197,3.153741,2.761224,7.008163
std,9.135373,403.509100,8.106864,1.024165,1.093082,1.106940,7141.338347,2.498009,0.360824,0.706476,6.126525
min,18.000000,102.000000,1.000000,1.000000,1.000000,1.000000,2094.000000,0.000000,3.000000,1.000000,0.000000
25%,30.000000,465.000000,2.000000,2.000000,2.000000,1.000000,8015.250000,1.000000,3.000000,2.000000,3.000000
50%,36.000000,802.000000,7.000000,3.000000,3.000000,2.000000,14220.000000,2.000000,3.000000,3.000000,5.000000
75%,43.000000,1157.000000,14.000000,4.000000,4.000000,3.000000,20475.500000,4.000000,3.000000,3.000000,9.000000
max,60.000000,1499.000000,29.000000,5.000000,4.000000,5.000000,26999.000000,9.000000,4.000000,4.000000,40.000000

In [182]:
print(abs(employee_data.count() - employee_data['Attrition'].count()))

Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EnvironmentSatisfaction     0
Gender                     31
JobLevel                    0
MaritalStatus               0
MonthlyRate                34
NumCompaniesWorked          0
OverTime                    0
PerformanceRating           0
WorkLifeBalance             0
YearsAtCompany              0
dtype: int64

In [183]:
employee_data.loc[employee_data['Gender'].isnull()]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,JobLevel,MaritalStatus,MonthlyRate,NumCompaniesWorked,OverTime,PerformanceRating,WorkLifeBalance,YearsAtCompany
30,33,No,Travel_Rarely,924,Research & Development,2,3,Medical,3,NaN,1,Single,6670.0,4,No,3,3,1
110,51,No,Travel_Frequently,1456,Research & Development,1,4,Medical,1,NaN,3,Single,25796.0,3,No,4,2,13
167,30,No,Travel_Rarely,1339,Sales,5,3,Life Sciences,2,NaN,3,Married,8053.0,2,No,3,3,10
233,50,No,Travel_Rarely,854,Sales,1,4,Medical,4,NaN,5,Divorced,NaN,3,No,3,2,7
282,29,No,Travel_Frequently,442,Sales,2,2,Life Sciences,2,NaN,2,Single,20260.0,1,No,3,2,10
335,40,No,Travel_Rarely,1124,Sales,1,2,Medical,2,NaN,2,Married,13273.0,2,Yes,4,2,4
365,46,No,Non-Travel,1144,Research & Development,7,4,Medical,3,NaN,2,Married,16044.0,2,No,3,4,1
369,31,No,Travel_Rarely,408,Research & Development,9,4,Life Sciences,3,NaN,1,Single,7551.0,0,Yes,3,3,2
442,36,No,Non-Travel,635,Sales,10,4,Medical,2,NaN,3,Single,15318.0,1,No,3,2,10
456,31,No,Travel_Rarely,688,Sales,7,3,Life Sciences,3,NaN,3,Divorced,25291.0,9,No,4,2,5
552,56,No,Travel_Rarely,832,Research & Development,9,3,Medical,3,NaN,4,Married,20420.0,7,No,3,2,10
650,43,No,Travel_Frequently,422,Research & Development,1,3,Life Sciences,4,NaN,2,Married,21782.0,4,No,3,2,5
712,33,No,Travel_Rarely,461,Research & Development,13,1,Life Sciences,2,NaN,1,Single,17241.0,3,No,3,3,3
713,45,No,Travel_Rarely,974,Research & Development,1,4,Medical,4,NaN,1,Divorced,11005.0,3,No,3,3,5
763,34,No,Travel_Rarely,1333,Sales,10,4,Life Sciences,3,NaN,1,Married,18410.0,1,Yes,3,3,1
803,34,No,Non-Travel,697,Research & Development,3,4,Life Sciences,3,NaN,1,Married,22478.0,3,No,3,3,0
825,29,No,Travel_Rarely,718,Research & Development,8,1,Medical,2,NaN,2,Married,17689.0,1,Yes,3,2,10
904,48,No,Travel_Rarely,715,Research & Development,1,3,Life Sciences,4,NaN,5,Single,8733.0,6,No,3,4,1
961,35,No,Travel_Frequently,482,Research & Development,4,4,Life Sciences,3,NaN,2,Single,2690.0,1,Yes,3,3,9
1010,55,No,Travel_Rarely,1136,Research & Development,1,4,Medical,2,NaN,4,Divorced,12414.0,2,No,3,4,7
1096,40,No,Travel_Rarely,898,Human Resources,6,2,Medical,3,NaN,4,Single,17381.0,1,Yes,4,3,21
1097,24,No,Travel_Rarely,350,Research & Development,21,2,Technical Degree,3,NaN,1,Divorced,10036.0,0,No,3,3,1
1130,35,No,Travel_Rarely,750,Research & Development,28,3,Life Sciences,2,NaN,2,Married,25348.0,1,No,3,2,10
1182,36,No,Non-Travel,894,Research & Development,1,4,Medical,4,NaN,2,Married,15411.0,0,No,3,3,3
1265,33,No,Non-Travel,775,Research & Development,4,3,Technical Degree,4,NaN,2,Divorced,6194.0,5,No,3,2,9
1303,47,No,Travel_Rarely,1001,Research & Development,4,3,Life Sciences,3,NaN,3,Divorced,19271.0,8,Yes,3,3,22
1305,54,No,Travel_Rarely,431,Research & Development,7,4,Medical,4,NaN,2,Married,15696.0,4,No,3,2,7
1348,40,No,Travel_Rarely,1137,Research & Development,1,4,Life Sciences,1,NaN,4,Divorced,18991.0,2,No,3,3,19
1409,40,No,Travel_Frequently,692,Research & Development,11,3,Technical Degree,4,NaN,2,Married,26849.0,1,No,3,4,10
1458,35,No,Travel_Rarely,287,Research & Development,1,4,Life Sciences,3,NaN,1,Married,NaN,1,No,3,3,4
1459,29,No,Travel_Rarely,1378,Research & Development,13,2,Other,4,NaN,2,Married,23679.0,4,Yes,3,3,4

In [184]:
# employee_data.loc[employee_data['Gender'].isnull()]['Gender'].interpolate(method='nearest')
# employee_data.loc[employee_data['Gender'].isnull()]['Gender']


employee_data[employee_data['Gender'].isnull()] = employee_data[employee_data['Gender'].isnull()]['Gender'].interpolate(method='nearest')
# employee_data.loc[employee_data['Gender'].isnull()]

# len(employee_data[employee_data['Gender'].isnull()]['Gender'].interpolate(method='nearest'))
# employee_data.loc[employee_data['Gender'].isnull()]['Gender']
len(employee_data[employee_data['Gender'].isnull()])

ValueError: Must have equal len keys and value when setting with an iterable

In [ ]:
employee_data.loc[employee_data['MonthlyRate'].isnull()]

In [ ]:
employee_data.loc[ employee_data["MonthlyRate"].isnull(), "MonthlyRate"] = employee_data['MonthlyRate'].mean()
employee_data.loc[employee_data['MonthlyRate'].isnull()]

In [ ]:
print(employee_data.loc[[30]])

### OneRule Algorithm Implementation

### Dataset Overview

### Evaluation